#+OPTIONS: toc:nil
#+PROPERTY: header-args :dir /tmp
#+BEGIN_EXPORT html
---
layout:     post
title:      How to Export Org-mode from the Command-Line
tags:       org-mode jekyll github-actions
---
#+END_EXPORT

Reproducible Org-mode files prove to the reader of your document that the code inside it works.
But, for your Org-mode file to be reproducible, the environment that it runs inside of should be as well.
The chain is as strong as its weakest link.

#+BEGIN_QUOTE
Literate programming is what you need to rise above the ordinary level of achievement. -- [[https://www.informit.com/articles/article.aspx?p=1193856][Donald Knuth]]
#+END_QUOTE

Exporting Org-mode from the command-line enables you to integrate reproducible literal programming.

The reproducibility in my blog wasn't as good as it could be. 
I committed both the source files (in Org-mode) as the export (in Markdown) to source control for reproducibility is to regenerate the Markdown file with every build of my blog.
You need to be able to call Emacs and export Org-mode files in a script for that.
There are some intricacies on how to achieve this related to calling Emacs from the command line and exporting Org-mode with babel source code blocks.
This post is to inspire those who want to do the same or got stuck trying.

I'll focus on how to interact with Emacs when using command-line scripting because it's not straightforward.

* Appendix

Emacs version:

#+BEGIN_SRC bash :results verbatim :exports results
emacs --version
#+END_SRC

#+RESULTS:
: GNU Emacs 26.2
: Copyright (C) 2019 Free Software Foundation, Inc.
: GNU Emacs comes with ABSOLUTELY NO WARRANTY.
: You may redistribute copies of GNU Emacs
: under the terms of the GNU General Public License.
: For more information about these matters, see the file named COPYING.

 Org-mode version:

#+BEGIN_SRC emacs-lisp :exports results
(org-version)
#+END_SRC

#+RESULTS:
: 9.1.3
